import { எழுத்து_குறிமுறை_சரிபார்த்தல் } from "../src/கருவிகள்";

test('தவறான எழுத்து', () => {
  const எழுத்து = "நான் எழுத்து கிடையாது"

  expect(() => {
    எழுத்து_குறிமுறை_சரிபார்த்தல்({
      எழுத்து,
      குறிமுறை: "base64"
    })
  }).toThrow(`தெரியாத எழுத்து "${எழுத்து}"`);
});


test('தவறான குறிமுறை', () => {
  const எழுத்து = "த";
  const குறிமுறை = "நான் குறிமுறை கிடையாது";

  expect(() => {
    எழுத்து_குறிமுறை_சரிபார்த்தல்({
      எழுத்து,
      குறிமுறை
    })
  }).toThrow(`"${எழுத்து}" எழுத்துக்கு தெரியாத குறிமுறை "${குறிமுறை}"`);
});
