import {எழுத்துகள்_அடைப்புகள்} from './எழுத்துகள்/குறியீட்டு.js';

const எழுத்துகள் = Object.keys(எழுத்துகள்_அடைப்புகள்);

export const கைரேகைை_பகுப்பாய்வு = ({
  கைரேகை,
}: {
  கைரேகை: string;
}): {எழுத்து: string; குறிமுறை: string} => {
  let மூனோட்டு = [...கைரேகை][0];

  // https://github.com/multiformats/multibase#multibase-table -ஐ பாரு
  if (மூனோட்டு === "1" || மூனோட்டு === "Q") {
    மூனோட்டு = "z"
  }

  for (const எ of எழுத்துகள்) {
    const மாற்றி_தகவல்கள் = Object.entries(எழுத்துகள்_அடைப்புகள்[எ]).find(
      இ => இ[1].முன்னோட்டு === மூனோட்டு
    );
    if (மாற்றி_தகவல்கள்) return {எழுத்து: எ, குறிமுறை: மாற்றி_தகவல்கள்[0]};
  }
  throw `தெரியாத மூனோட்டு ${மூனோட்டு} (கைரேகை: ${கைரேகை})`;
};
