import { எழுத்து_குறிமுறை_சரிபார்த்தல் } from "@/கருவிகள்.js";
import { expect } from "aegir/chai";

it('தவறான எழுத்து', () => {
  const எழுத்து = "நான் எழுத்து கிடையாது"

  expect(() => {
    எழுத்து_குறிமுறை_சரிபார்த்தல்({
      எழுத்து,
      குறிமுறை: "base64"
    })
  }).to.throw(`தெரியாத எழுத்து "${எழுத்து}"`);
});


it('தவறான குறிமுறை', () => {
  const எழுத்து = "த";
  const குறிமுறை = "நான் குறிமுறை கிடையாது";

  expect(() => {
    எழுத்து_குறிமுறை_சரிபார்த்தல்({
      எழுத்து,
      குறிமுறை
    })
  }).to.throw(`"${எழுத்து}" எழுத்துக்கு தெரியாத குறிமுறை "${குறிமுறை}"`);
});
